-*- coding: utf-8 -*-

#+title: Emacs: New Config in an Org file
#+STARTUP: show3levels
#+property: header-args:emacs-lisp  :tangle ~/emacs/tja.el

* Mail

Not using mail so let's unset the send-mail key

#+begin_src emacs-lisp :results raw
  (global-unset-key (kbd "C-x m"))
#+end_src

#+RESULTS:
nil

* Git

#+begin_src emacs-lisp :results raw
  (defun m/git:check-and-switch-git-branch (dir branch)
    "Check if the Git repository in DIR is on the specified BRANCH.
  If not, try to switch to that branch. Print a warning if the branch doesn't exist."
    (let* ((default-directory dir)
           (current-branch (string-trim (shell-command-to-string (format "git -C %s rev-parse --abbrev-ref HEAD" dir)))))
      (if (string-equal current-branch branch)
          (message "Already on branch '%s'." branch)
        (if (string-match-p (regexp-quote branch)
                            (shell-command-to-string (format "git -C %s branch --list" dir)))
            (progn
              (shell-command (format "git -C %s checkout %s" dir branch))
              (message "Switched to branch '%s'." branch))
          (message "Warning: Branch '%s' does not exist in the repository at '%s'." branch dir)))))
#+end_src

#+RESULTS:
m/git:check-and-switch-git-branch

* Compile

#+begin_src emacs-lisp :results raw
  (setq special-display-buffer-names
        '("*compilation*"))

  ;; Stop compilation buffer from appearing in new window
  (setq special-display-function
        (lambda (buffer &optional args)
          (get-buffer-window buffer 0)))

  ;;;###autoload
  (defun tja-compile-leads-api-unit-tests ()
    (interactive)
    (compile "dotnet test /home/trevor/projects/goddard/src/ipaas-leads-api/Goddard.LeadsApi.UnitTests/Goddard.LeadsApi.UnitTests.csproj"))

  (defun my:get-integration-test-command-with-filter (testcmd filter)
    (let* ((cmd (concat "dotnet test --logger='console;verbosity=detailed' " testcmd))
           (cmd (if (> (length filter) 0) (concat cmd " --filter \"" filter "\"") cmd)))
      cmd))

  ;;;###autoload
  (defun my:compile-leads-api-integration-tests (filter)
    (interactive "sFilter: ")
    (let ((cmd (my:get-integration-test-command-with-filter
                "/home/trevor/projects/goddard/src/ipaas-leads-api/Goddard.LeadsApi.IntegrationTests/Goddard.LeadsApi.IntegrationTests.csproj"
                filter)))
      (compile cmd)))

  ;;;###autoload
  (defun my:compile-recognitions-api-integration-tests (filter)
    (interactive "sFilter: ")
    (let ((cmd (my:get-integration-test-command-with-filter
                "/home/trevor/projects/goddard/src/ipaas-recognitions-api/GoddardRecognitions.IntegrationTests/GoddardRecognitions.IntegrationTests.csproj"
                filter)))
      (compile cmd)))

  ;;;###autoload
  (defun m/gsi:compile-tours-api-unit-tests ()
    (interactive)
    (compile "dotnet test /home/trevor/projects/goddard/src/ipaas-tours-api/Goddard.ToursWebApi.UnitTests/Goddard.ToursWebApi.UnitTests.csproj"))

  ;;;###autoload
  (defun m/gsi:compile-tours-api-integration-tests (filter)
    (interactive "sFilter: ")
    (let ((cmd (my:get-integration-test-command-with-filter "/home/trevor/projects/goddard/src/ipaas-tours-api/Goddard.ToursWebApi.IntegrationTests/Goddard.ToursWebApi.IntegrationTests.csproj" filter)))
      (compile cmd)))
#+end_src

#+RESULTS:
m/gsi:compile-tours-api-integration-tests
tja-compile-leads-api-integration-test

** Org workflow movement

#+begin_src emacs-lisp :results raw
  (defun my:org-meta-move-to-top (&optional _arg)
    "Move the item at point up to the top of the org file just after the first header"
    (interactive "P")
    (cond
     ((run-hook-with-args-until-success 'org-metaup-hook))
     ((org-region-active-p)
      (let* ((a (save-excursion
                  (goto-char (region-beginning))
                  (line-beginning-position)))
             (b (save-excursion
                  (goto-char (region-end))
                  (if (bolp) (1- (point)) (line-end-position))))
             (c (save-excursion
                  (goto-char a)
                  (move-beginning-of-line 0)
                  (point)))
             (d (save-excursion
                  (goto-char a)
                  (move-end-of-line 0)
                  (point))))
        (transpose-regions a b c d)
        (goto-char c)))
     ((org-at-table-p) (org-call-with-arg 'org-table-move-row 'up))
     ((and (featurep 'org-inlinetask)
           (org-inlinetask-in-task-p))
      (org-drag-element-backward))
     ((org-at-heading-p) (call-interactively 'org-move-subtree-up))
     ((org-at-item-p) (call-interactively 'org-move-item-up))
     (t (org-drag-element-backward))))
    (defun my:org-move-item-to-top ()
      "Move the item at point up to the top of the org file just after the first header"
      (interactive)
      (unless (org-at-item-p) (error "Not at an item"))
      (let* ((col (current-column))
             (item (line-beginning-position))
             (struct (org-list-struct))
             (prevs (org-list-prevs-alist struct))
             (prev-item (org-list-get-prev-item (line-beginning-position) struct prevs)))
        (unless (or prev-item org-list-use-circular-motion)
          (user-error "Cannot move this item further up"))
        (if (not prev-item)
            (setq struct (org-list-send-item item 'end struct))
          (setq struct (org-list-swap-items prev-item item struct)))
        (org-list-write-struct struct (org-list-parents-alist struct))
        (org-move-to-column col)))
#+end_src

#+RESULTS:
my:org-move-item-to-top

